<a href="https://colab.research.google.com/github/KamilBienias/data-science/blob/main/training/analityk.edu.pl/pandas_tutorial/10_zmiana_typu_danych_w_csv.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [49]:
# https://analityk.edu.pl/python-pandas-tutorial-typy-danych/

# **Python Pandas Tutorial – typy danych**

Pandas rozpoznaje, podobnie jak Python, różne typy danych – liczby, ciągle znaków itd. Prawda jest jednak taka, że nie przejmujemy się tym zbytnio, do czasu otrzymania związanego z typami danych błędu. Dopiero wtedy zaczyny dociekać na czym się różnią typy danych i jak je pozamieniać. I dokładnie takie podejście zastosujemy w tej lekcji. Zaczynajmy!
W tej lekcji skorzystamy ze zbioru danych zawierającego informacje o filmach.

In [50]:
# nie trzeba pobierać plik film.csv bo od razu go w locie zamieniam na df
# !wget -O film.csv "https://drive.google.com/uc?export=download&id=1Ofob2EV42qPeJSpIlhxnsEMAdEvnop7l"

In [51]:
import pandas as pd

# odczytanie df z pobranego pliku csv
# films = pd.read_csv('film.csv', sep=';', encoding = "ISO-8859-1")
# films

# pobieram bezpośrednio z dysku google i zamieniam na df
films = pd.read_csv('https://drive.google.com/uc?export=download&id=1Ofob2EV42qPeJSpIlhxnsEMAdEvnop7l', sep=';', encoding = "ISO-8859-1")
films

      Year Length                     Title  ... Popularity Awards            *Image
0      INT    INT                    STRING  ...        INT   BOOL            STRING
1     1990    111   Tie Me Up! Tie Me Down!  ...         68     No  NicholasCage.png
2     1991    113                High Heels  ...         68     No  NicholasCage.png
3     1983    104            Dead Zone, The  ...         79     No  NicholasCage.png
4     1979    122                      Cuba  ...          6     No   seanConnery.png
...    ...    ...                       ...  ...        ...    ...               ...
1655  1932    226  Shadow of the Eagle, The  ...         19     No     johnWayne.png
1656  1989    103              Blood & Guns  ...         43     No  NicholasCage.png
1657  1988     78                 Hot Money  ...         19     No  NicholasCage.png
1658  1977     75            Comedy Tonight  ...         18     No  NicholasCage.png
1659  1991     65            Robin Williams  ...          4     No  NicholasCage.png

[1660 rows x 10 columns]

Plik jest już problematyczny od samego początku. Separatorem w tym pliku jest średnik ';', a nie tak jak to zwykle bywa w przypadku plików csv – przecinek oraz został zapisany w standardzie '”ISO-8859-1″. Jest to dość rzadkie. Na ogół pliki CSV są zapisywane w standardzie UTF-8 i ich odczyt nie stanowi problemu.

Widzimy że pierwszy wiersz w pliku zawiera typ kolumn, tak więc ten wiersz jest interesujący, jednak do skasowania. Ostatnia kolumna jest *Image jest również do skasowania, nie przyda nam się.

In [52]:
# Kasujemy pierwszy wiersz
films = films.drop(0)

# Kasujemy ostatnią kolumnę
films = films.drop(columns=['*Image'])

films

      Year Length  ... Popularity Awards
1     1990    111  ...         68     No
2     1991    113  ...         68     No
3     1983    104  ...         79     No
4     1979    122  ...          6     No
5     1978     94  ...         14     No
...    ...    ...  ...        ...    ...
1655  1932    226  ...         19     No
1656  1989    103  ...         43     No
1657  1988     78  ...         19     No
1658  1977     75  ...         18     No
1659  1991     65  ...          4     No

[1659 rows x 9 columns]

Zobaczmy jaka jest średnia długość filmu.

In [53]:
# films.Length.mean()

Operacja kończy się jednak błędem. Otrzymujemy informację o:

'TypeError: can only concatenate str (not „int”) to str'. 

Świadczy to o problemie z typem danych. Czyli nasza kolumna Length nie jest rozpoznana przez Pandas jako liczby.

## **Typy danych w Pandas DataFrame**

Na początku sprawdźmy jak Pandas widzi nasz zbiór danych. Możemy skorzystać z funkcji info() lub parametru dtypes:

In [54]:
films.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1659 entries, 1 to 1659
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        1659 non-null   object
 1   Length      1592 non-null   object
 2   Title       1659 non-null   object
 3   Subject     1657 non-null   object
 4   Actor       1651 non-null   object
 5   Actress     1281 non-null   object
 6   Director    1406 non-null   object
 7   Popularity  1653 non-null   object
 8   Awards      1659 non-null   object
dtypes: object(9)
memory usage: 129.6+ KB

Widzimy że nasz zbiór zawiera trochę wartości pustych, ale przede wszystkim, że wszystkie kolumny są rozpoznane jako typ object.

Python Pandas rozpoznaje następujące typy danych:

Typ danych w DataFrame -- Odpowiednik w Python

object ------------------------------> String (łańcuch znaków)

int64 -------------------------------> Integer (liczba całkowita)

float64 ---------------------------->	Float (liczba rzeczywiste)

bool --------------------------------> bool (True lub False)

Category -------------------------> NA

datetime --------------------------> datetime


Tak jak widzimy typy danych w Pandas są bardzo podobne do tych znanych nam z Python. Dodatkowo mamy do dyspozycji Category. No ale wróćmy do naszego problemu.

Na kolumnie która została wczytana z pliku jako typ object (czyli zmienna przeznaczona do przechowywania tekstu) próbujemy wykonać operację matematyczną. Tym samym musimy zmienić typ naszej kolumny na taką która pozwoli nam na operacje matematyczne – int64 lub float64.

## **Zamiana typów danych w Pandas DataFrame**

W Pandas mamy kilka możliwości zmiany typu danych. Niektóre z nich już poznaliśmy i zobaczmy ponownie a niektóre będą czymś nowym.

### **to_numeric()**

Jest to najprostszy sposób zamiany kolumn, które są rozpoznane jako typ object, a zawierają liczby, na typ danych numeryczny.

In [55]:
films.Length = pd.to_numeric(films.Length)
films.dtypes

Year           object
Length        float64
Title          object
Subject        object
Actor          object
Actress        object
Director       object
Popularity     object
Awards         object
dtype: object

Tym samym, widzimy że typ danych kolumny lenght został zamieniony na float64. A my możemy wykonać operacje matematyczne na tej kolumnie, takie jak policzenie średniej długości trwania filmu w naszej bazie danych.

In [56]:
films.Length.mean()

105.17964824120602

### **astype()**

Funkcja astype() jest troszkę starsza od funkcji to_numeric(), ale za to daje większe możliwości. Funkcja to_numeric, sama dobrała typ danych, ale ograniczała się tylko do zamiany object na liczby. astype() wymaga ręcznego podania typu danych który chcemy osiągnąć ale możemy próbować zamieniać dowolne typy danych na dowolne inne.

In [58]:
films.Popularity = films.Popularity.astype('float64')
films.dtypes

Year           object
Length        float64
Title          object
Subject        object
Actor          object
Actress        object
Director       object
Popularity    float64
Awards         object
dtype: object

### **apply()**

Trzecim sposobem, na zmianę typu danych o którym powiemy, jest sposób najbardziej uniwersalny i potężny. Otóż możemy zastosować funkcję apply, która może czytać wartość w jednym formacie, a zwracać ją w zupełnie innych.

Dla przykładu, pod lupę wezmę kolumnę Award. Czyli informację czy dany film dostał nagrodę czy też nie. Zamienie typ tej kolumny na bool, natomiast jeżeli dostał nagrodę (wartość Yes) to wpiszę True. W innym przypadku wpiszę wartość False:

In [59]:
def zamien(wartosc):
    if wartosc == 'No': 
        return False
    if wartosc == 'Yes': 
        return True
    
films.Awards = films.Awards.apply(zamien)
films.dtypes

Year           object
Length        float64
Title          object
Subject        object
Actor          object
Actress        object
Director       object
Popularity    float64
Awards           bool
dtype: object

Rozwiązanie krótkie, czytelne, efektywne. Nasz zbiór wygląda teraz tak:

In [61]:
films.Awards

1       False
2       False
3       False
4       False
5       False
        ...
1655    False
1656    False
1657    False
1658    False
1659    False
Name: Awards, Length: 1659, dtype: bool

## **Zmiana typów podczas wczytywania pliku CSV**

Powyżej zobaczyliśmy jak możemy poczyścić nasz zbiór danych usuwając kolumny, wiersze i nadając odpowiednie typy danych naszym kolumnom. Są to jak najbardziej słuszne rozwiązania. Jednak teraz, kiedy wiemy z jakimi problemami mieliśmy od czynienia, warto zadać sobie pytanie czy nie warto wykonać części z tych operacji na etapie czytania pliku?

Okazuje się że z funkcją read_csv() jest to możliwe korzystając z dodatkowych parametrów takich jak:

dtype, który zdefiniuje nam od razu typy kolumn,

skiprows, który umożliwi nam ominięcie pierwszego, problematycznego wiersza.

usecols, gdzie możemy podać interesujące nas kolumny

converters, który umożliwia nam zastosowanie apply

In [62]:
def zamien(wartosc):
    if wartosc == 'No': return False
    if wartosc == 'Yes': return True

films = pd.read_csv('https://drive.google.com/uc?export=download&id=1Ofob2EV42qPeJSpIlhxnsEMAdEvnop7l', 
                    sep=';', 
                    encoding = "ISO-8859-1",
                    skiprows=[1],
                    dtype={'Length':'float64', 'Popularity':'float64'},
                    usecols=['Year','Length','Title','Subject','Popularity','Awards'],
                    converters={'Awards':zamien})

films

      Year  Length                     Title Subject  Popularity  Awards
0     1990   111.0   Tie Me Up! Tie Me Down!  Comedy        68.0   False
1     1991   113.0                High Heels  Comedy        68.0   False
2     1983   104.0            Dead Zone, The  Horror        79.0   False
3     1979   122.0                      Cuba  Action         6.0   False
4     1978    94.0            Days of Heaven   Drama        14.0   False
...    ...     ...                       ...     ...         ...     ...
1654  1932   226.0  Shadow of the Eagle, The  Action        19.0   False
1655  1989   103.0              Blood & Guns  Action        43.0   False
1656  1988    78.0                 Hot Money   Drama        19.0   False
1657  1977    75.0            Comedy Tonight  Comedy        18.0   False
1658  1991    65.0            Robin Williams  Comedy         4.0   False

[1659 rows x 6 columns]

In [63]:
films.dtypes

Year            int64
Length        float64
Title          object
Subject        object
Popularity    float64
Awards           bool
dtype: object

Mało tego, dla tych który znają funkcje lambda, możemy uprościć nasz zapis do takiej postaci:

In [64]:
films = pd.read_csv('https://drive.google.com/uc?export=download&id=1Ofob2EV42qPeJSpIlhxnsEMAdEvnop7l', 
                    sep=';', 
                    encoding = "ISO-8859-1",
                    skiprows=[1],
                    dtype={'Length':'float64', 'Popularity':'float64'},
                    usecols=['Year','Length','Title','Subject','Popularity','Awards'],
                    converters={'Awards':lambda x: True if x == 'Yes' else False})

films

      Year  Length                     Title Subject  Popularity  Awards
0     1990   111.0   Tie Me Up! Tie Me Down!  Comedy        68.0   False
1     1991   113.0                High Heels  Comedy        68.0   False
2     1983   104.0            Dead Zone, The  Horror        79.0   False
3     1979   122.0                      Cuba  Action         6.0   False
4     1978    94.0            Days of Heaven   Drama        14.0   False
...    ...     ...                       ...     ...         ...     ...
1654  1932   226.0  Shadow of the Eagle, The  Action        19.0   False
1655  1989   103.0              Blood & Guns  Action        43.0   False
1656  1988    78.0                 Hot Money   Drama        19.0   False
1657  1977    75.0            Comedy Tonight  Comedy        18.0   False
1658  1991    65.0            Robin Williams  Comedy         4.0   False

[1659 rows x 6 columns]

In [65]:
films.dtypes

Year            int64
Length        float64
Title          object
Subject        object
Popularity    float64
Awards           bool
dtype: object